Documents/ВыпускПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыпускПродукции</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ингредиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВыпускПродукции/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // === ШАГ 1. Собираем требуемое количество по каждому ингредиенту ===
    ТребуемоеКоличество = Новый Соответствие;
    
    Для Каждого СтрокаТЧ Из Ингредиенты Цикл
        
        Если СтрокаТЧ.Количество <= 0 Тогда
            Продолжить;
        КонецЕсли;
        
        Текущее = ТребуемоеКоличество[СтрокаТЧ.Номенклатура];
        Если Текущее = Неопределено Тогда
            Текущее = 0;
        КонецЕсли;
        
        ТребуемоеКоличество[СтрокаТЧ.Номенклатура] = Текущее + СтрокаТЧ.Количество;
        
    КонецЦикла;
    
    // === ШАГ 2. Контроль остатков ===
    Если ТребуемоеКоличество.Количество() > 0 Тогда
        
        СписокНоменклатуры = Новый Массив;
        Для Каждого КлючЗначение Из ТребуемоеКоличество Цикл
            СписокНоменклатуры.Добавить(КлючЗначение.Ключ);
        КонецЦикла;
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
            "ВЫБРАТЬ
            |    Остатки.Номенклатура КАК Номенклатура,
            |    Остатки.КоличествоОстаток КАК КоличествоОстаток
            |ИЗ
            |    РегистрНакопления.ОстаткиМатериалов.Остатки(
            |        &Дата,
            |        Склад = &Склад
            |            И Номенклатура В (&СписокНоменклатуры)) КАК Остатки";
        
        Запрос.УстановитьПараметр("Дата", МоментВремени());
        Запрос.УстановитьПараметр("Склад", Склад);
        Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
        
        Выборка = Запрос.Выполнить().Выбрать();
        
        Пока Выборка.Следующий() Цикл
            
            Требуется = ТребуемоеКоличество[Выборка.Номенклатура];
            Если Требуется = Неопределено Тогда
                Требуется = 0;
            КонецЕсли;
            
            Если Выборка.КоличествоОстаток < Требуется Тогда
                Сообщение = Новый СообщениеПользователю;
                Сообщение.Текст = СтрШаблон(
                    "Не хватает материала ""%1"" на складе ""%2"". Требуется %3, в наличии %4.",
                    Выборка.Номенклатура,
                    Склад,
                    Формат(Требуется, "ЧДЦ=3; ЧН="),
                    Формат(Выборка.КоличествоОстаток, "ЧДЦ=3; ЧН="));
                Сообщение.Сообщить();
                Отказ = Истина;
            КонецЕсли;
            
        КонецЦикла;
        
    КонецЕсли;
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    // === ШАГ 3. Расход ингредиентов ===
    Движения.ОстаткиМатериалов.Записывать = Истина;
    
    Для Каждого СтрокаТЧ Из Ингредиенты Цикл
        
        Если СтрокаТЧ.Количество <= 0 Тогда
            Продолжить;
        КонецЕсли;
        
        Движение = Движения.ОстаткиМатериалов.Добавить();
        Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
        Движение.Период       = Дата;
        Движение.Склад        = Склад;
        Движение.Номенклатура = СтрокаТЧ.Номенклатура;
        Движение.Количество   = СтрокаТЧ.Количество;
        
    КонецЦикла;
    
    // === ШАГ 4. Приход готовой продукции ===
    Движение = Движения.ОстаткиМатериалов.Добавить();
    Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
    Движение.Период       = Дата;
    Движение.Склад        = Склад;
    Движение.Номенклатура = Продукция;
    Движение.Количество   = КоличествоПродукции;
    
КонецПроцедуры
